jmeter_test_plan.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.4.1">
    <hashTree>
        <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Web Server Test Plan" enabled="true">
            <stringProp name="TestPlan.comments">JMeter test for single-threaded and multi-threaded web servers</stringProp>
            <boolProp name="TestPlan.functional_mode">false</boolProp>
            <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
            <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
            <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true"/>
            <hashTree>
                <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="User Load Simulation" enabled="true">
                    <stringProp name="ThreadGroup.num_threads">10</stringProp>
                    <stringProp name="ThreadGroup.ramp_time">5</stringProp>
                    <boolProp name="ThreadGroup.scheduler">false</boolProp>
                    <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
                        <boolProp name="LoopController.continue_forever">false</boolProp>
                        <stringProp name="LoopController.loops">10</stringProp>
                    </elementProp>
                </ThreadGroup>
                <hashTree>
                    <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Web Server Request" enabled="true">
                        <stringProp name="HTTPSampler.domain">localhost</stringProp>
                        <stringProp name="HTTPSampler.port">8010</stringProp>
                        <stringProp name="HTTPSampler.protocol">http</stringProp>
                        <stringProp name="HTTPSampler.path">/</stringProp>
                        <stringProp name="HTTPSampler.method">GET</stringProp>
                    </HTTPSamplerProxy>
                    <hashTree/>
                    <ResultCollector guiclass="ViewResultsTreeGui" testclass="ResultCollector" testname="View Results Tree" enabled="true">
                        <boolProp name="ResultCollector.error_logging">false</boolProp>
                    </ResultCollector>
                    <hashTree/>
                </hashTree>
            </hashTree>
        </TestPlan>
    </hashTree>
</jmeterTestPlan>